[[["1de1e510-cc14-42ab-bde4-149f2cecb7b9",{"pageContent":"Q: Who is Long Tran?\nA: He is the owner of this restaurant.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":1,"to":2}}}}],["e199a0f5-934a-443f-8e34-f673bf512fe4",{"pageContent":"Q: Can you tell me about your signature dishes?\nA: Our signature dishes include our locally-sourced Steak with Truffle Butter, and our Seasonal Vegetable Pasta, which changes based on what's fresh and in season.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":4,"to":5}}}}],["8a2b6ae2-0f0f-478b-a349-72cffb396e92",{"pageContent":"Q: What's included in your Seafood Platter?\nA: Our Seafood Platter includes a selection of the freshest catch of the day, including oysters, prawns, clams, and grilled fish, served with our house special sauce.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":7,"to":8}}}}],["3c8cd0c4-660e-415f-9c81-aa209d8cd029",{"pageContent":"Q: Do you have any specials or promotions running currently?\nA: Yes, we have a Happy Hour promotion from 3 to 5 p.m. on weekdays, with special prices on selected appetizers and drinks.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":10,"to":11}}}}],["7d8a7b48-955f-4ae4-89bd-4c22cc449e54",{"pageContent":"Q: What are the ingredients in your gluten-free options?\nA: Our gluten-free dishes are prepared using a variety of ingredients that don't contain gluten. Some options include our Quinoa Salad and our Grilled Chicken with Roasted Vegetables.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":13,"to":14}}}}],["9ec436bd-3474-43dc-a9dd-25dec7f801ca",{"pageContent":"Q: What steps is your restaurant taking to ensure safety amid the ongoing pandemic?\nA: We adhere to strict health and safety protocols, including regular sanitization, maintaining physical distance between tables, and providing hand sanitizers for customers. We also offer contactless pickup and delivery options.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":16,"to":17}}}}],["c3535a07-4a13-48f1-ae76-5e17be1e9e6a",{"pageContent":"Q: Can I request alterations to a dish due to allergies?\nA: Absolutely, we strive to accommodate all of our customers' needs. Please inform our staff about any allergies you have, and we'll do our best to modify the dish accordingly.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":19,"to":20}}}}],["c2cc9079-6fb9-42de-87fc-8aed7e441988",{"pageContent":"Q: What are the hours of operation for your restaurant?\nA: Our restaurant is open from 11 a.m. to 10 p.m. from Monday to Saturday. On Sundays, we open at 12 p.m. and close at 9 p.m.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":22,"to":23}}}}],["1f9d3244-bea0-4af5-ae05-80ce8587e0ef",{"pageContent":"Q: What type of cuisine does your restaurant serve?\nA: Our restaurant specializes in contemporary American cuisine with an emphasis on local and sustainable ingredients.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":25,"to":26}}}}],["dc7ad55d-551a-44c9-a094-da441a3472e2",{"pageContent":"Q: Do you offer vegetarian or vegan options?\nA: Yes, we have a range of dishes to cater to vegetarians and vegans. Please let our staff know about any dietary restrictions you have when you order.","metadata":{"source":"./restaurant.txt","loc":{"lines":{"from":28,"to":29}}}}]],{"0":"1de1e510-cc14-42ab-bde4-149f2cecb7b9","1":"e199a0f5-934a-443f-8e34-f673bf512fe4","2":"8a2b6ae2-0f0f-478b-a349-72cffb396e92","3":"3c8cd0c4-660e-415f-9c81-aa209d8cd029","4":"7d8a7b48-955f-4ae4-89bd-4c22cc449e54","5":"9ec436bd-3474-43dc-a9dd-25dec7f801ca","6":"c3535a07-4a13-48f1-ae76-5e17be1e9e6a","7":"c2cc9079-6fb9-42de-87fc-8aed7e441988","8":"1f9d3244-bea0-4af5-ae05-80ce8587e0ef","9":"dc7ad55d-551a-44c9-a094-da441a3472e2"}]